In [1]:
#%load_ext nb_black
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine
engine = create_engine("sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3")
conlt = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3")
conmy = engine.connect()
engine = create_engine(
    "postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development"
)
conpg = engine.connect()
format_dict = {
    "q_amt": "{:,}",
    "y_amt": "{:,}",
    "yoy_gain": "{:,}",
    "q_amt_c": "{:,}",
    "q_amt_p": "{:,}",
    "aq_amt": "{:,}",
    "ay_amt": "{:,}",
    "acc_gain": "{:,}",
    "latest_amt": "{:,}",
    "previous_amt": "{:,}",
    "inc_amt": "{:,}",
    "latest_amt_q": "{:,}",
    "previous_amt_q": "{:,}",
    "inc_amt_q": "{:,}",
    "latest_amt_y": "{:,}",
    "previous_amt_y": "{:,}",
    "inc_amt_y": "{:,}",
    "inc_pct": "{:.2f}",
    "inc_pct_q": "{:.2f}",
    "inc_pct_y": "{:.2f}",
}
year = 2021
quarter = 3
today = date.today()
today_str = today.strftime("%Y-%m-%d")
today_str

'2021-12-10'

In [2]:
#today = date(2021, 11, 12)
today_str = today.strftime("%Y-%m-%d")
today_str

'2021-12-01'

### Process for specified stocks

In [2]:
names = """
IP
""".split()
names

['IP']

In [3]:
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

"'IP'"

In [4]:
sql = """
SELECT name,year,quarter,q_amt,y_amt,aq_amt,ay_amt 
FROM epss 
WHERE year = %s AND quarter = %s
AND name IN (%s)
"""
sql = sql % (year, quarter, in_p)
epss = pd.read_sql(sql, conlt)
epss.style.format(format_dict)

### End of Process for specified stocks

In [4]:
sql = '''
SELECT name,year,quarter,q_amt,y_amt,aq_amt,ay_amt 
FROM epss 
WHERE year = %s AND quarter = %s
AND publish_date >= "%s"'''
sql = sql % (year, quarter, today_str)
epss = pd.read_sql(sql, conlt)
epss.shape[0]

48

### End of Normal Process

In [5]:
sql = '''
SELECT name, year, quarter, latest_amt, previous_amt, inc_amt, inc_pct 
FROM qt_profits 
WHERE year = %s AND quarter = "Q%s"'''
sql = sql % (year, quarter)
qt_pf = pd.read_sql(sql, conlt)
qt_pf.shape[0]

335

In [6]:
df_merge = pd.merge(epss, qt_pf, on=["name"], suffixes=(["_e", "_q"]), how="inner")
df_merge

,name,year_e,quarter_e,q_amt,y_amt,aq_amt,ay_amt,year_q,quarter_q,latest_amt,previous_amt,inc_amt,inc_pct
0,IP,2021,3,25710,18457,69153,49252,2021,Q3,73677,66424,7253,10.919246

### Delete duplicated year and quarter

In [7]:
columns = ["year_q", "quarter_q"]
epssqt_pf = df_merge.drop(columns, axis=1)
epssqt_pf

,name,year_e,quarter_e,q_amt,y_amt,aq_amt,ay_amt,latest_amt,previous_amt,inc_amt,inc_pct
0,IP,2021,3,25710,18457,69153,49252,73677,66424,7253,10.919246

In [8]:
sql = '''
SELECT name, year, quarter, latest_amt, previous_amt, inc_amt, inc_pct 
FROM yr_profits 
WHERE year = %s AND quarter = "Q%s"'''
sql = sql % (year, quarter)
yr_pf = pd.read_sql(sql, conlt)
yr_pf.shape[0]

329

In [9]:
df_merge2 = pd.merge(
    epssqt_pf, yr_pf, on=["name"], suffixes=(["_q", "_y"]), how="inner"
)
df_merge2

,name,year_e,quarter_e,q_amt,y_amt,aq_amt,ay_amt,latest_amt_q,previous_amt_q,inc_amt_q,inc_pct_q,year,quarter,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y
0,IP,2021,3,25710,18457,69153,49252,73677,66424,7253,10.919246,2021,Q3,73677,61952,11725,18.925943

### Delete duplicated year and quarter

In [10]:
columns = ["year_e", "quarter_e"]
profits = df_merge2.drop(columns, axis=1)
profits

,name,q_amt,y_amt,aq_amt,ay_amt,latest_amt_q,previous_amt_q,inc_amt_q,inc_pct_q,year,quarter,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y
0,IP,25710,18457,69153,49252,73677,66424,7253,10.919246,2021,Q3,73677,61952,11725,18.925943

In [11]:
cols = [
    "name",
    "year",
    "quarter",
    "latest_amt_y",
    "previous_amt_y",
    "inc_amt_y",
    "inc_pct_y",
]

### profits criteria
1. Yearly profit amount > 440 millions
2. Previous yearly gain amount > 400 millions
3. Yearly gain percent >= 10 percent

In [12]:
profits[profits["name"] == "IP"]

,name,q_amt,y_amt,aq_amt,ay_amt,latest_amt_q,previous_amt_q,inc_amt_q,inc_pct_q,year,quarter,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y
0,IP,25710,18457,69153,49252,73677,66424,7253,10.919246,2021,Q3,73677,61952,11725,18.925943

In [13]:
criteria_1 = profits.latest_amt_y > 73_000
profits.loc[criteria_1, cols].sort_values(by=["name"], ascending=True)

  name  year quarter  latest_amt_y  previous_amt_y  inc_amt_y  inc_pct_y
0   IP  2021      Q3         73677           61952      11725  18.925943

In [14]:
criteria_2 = profits.previous_amt_y >= 61_000
profits.loc[criteria_2, cols].sort_values(by=["name"], ascending=True)

  name  year quarter  latest_amt_y  previous_amt_y  inc_amt_y  inc_pct_y
0   IP  2021      Q3         73677           61952      11725  18.925943

In [15]:
criteria_3 = profits.inc_pct_y >= 10
profits.loc[criteria_3, cols]

  name  year quarter  latest_amt_y  previous_amt_y  inc_amt_y  inc_pct_y
0   IP  2021      Q3         73677           61952      11725  18.925943

In [16]:
profits_criteria = criteria_1 & criteria_2 & criteria_3
#profits_criteria = criteria_1 & criteria_3 
filter = profits.loc[profits_criteria]
filter.sort_values('name')

,name,q_amt,y_amt,aq_amt,ay_amt,latest_amt_q,previous_amt_q,inc_amt_q,inc_pct_q,year,quarter,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y
0,IP,25710,18457,69153,49252,73677,66424,7253,10.919246,2021,Q3,73677,61952,11725,18.925943

In [17]:
columns = ["year", "quarter", "q_amt", "y_amt", "aq_amt", "ay_amt"]
final = filter.drop(columns, axis=1)
final

,name,latest_amt_q,previous_amt_q,inc_amt_q,inc_pct_q,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y
0,IP,73677,66424,7253,10.919246,73677,61952,11725,18.925943

In [18]:
final.sort_values(by=["name"], ascending=True)

,name,latest_amt_q,previous_amt_q,inc_amt_q,inc_pct_q,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y
0,IP,73677,66424,7253,10.919246,73677,61952,11725,18.925943

In [19]:
sql = """
SELECT A.name,A.year,A.quarter,A.q_amt AS q_amt_c,A.y_amt,B.q_amt AS q_amt_p 
FROM epss A JOIN epss B ON a.name = B.name 
WHERE A.year = %s AND A.quarter = %s 
AND B.year = %s AND B.quarter = (%s-1)"""
sql = sql % (year, quarter, year, quarter)
print(sql)

SELECT A.name,A.year,A.quarter,A.q_amt AS q_amt_c,A.y_amt,B.q_amt AS q_amt_p
FROM epss A JOIN epss B ON a.name = B.name
WHERE A.year = 2021 AND A.quarter = 3
AND B.year = 2021 AND B.quarter = (3-1)

In [20]:
epss2 = pd.read_sql(sql, conlt)
epss2.shape[0]

339

In [21]:
df_merge3 = pd.merge(final, epss2, on=["name"], suffixes=(["_f", "_e"]), how="inner")
df_merge3

,name,latest_amt_q,previous_amt_q,inc_amt_q,inc_pct_q,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y,year,quarter,q_amt_c,y_amt,q_amt_p
0,IP,73677,66424,7253,10.919246,73677,61952,11725,18.925943,2021,3,25710,18457,24762

In [22]:
final2 = df_merge3[
    [
        "name",
        "year",
        "quarter",
        "latest_amt_y",
        "previous_amt_y",
        "inc_amt_y",
        "inc_pct_y",
        "latest_amt_q",
        "previous_amt_q",
        "inc_amt_q",
        "inc_pct_q",
        "q_amt_c",
        "y_amt",
        "q_amt_p",
    ]
]
final2

,name,year,quarter,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y,latest_amt_q,previous_amt_q,inc_amt_q,inc_pct_q,q_amt_c,y_amt,q_amt_p
0,IP,2021,3,73677,61952,11725,18.925943,73677,66424,7253,10.919246,25710,18457,24762

In [23]:
def better(vals):
    current, previous = vals
    if current > previous:
        return 1
    else:
        return 0

In [24]:
final2["kind"] = final2[["q_amt_c", "q_amt_p"]].apply(better, axis=1)

C:\Users\User\AppData\Local\Temp/ipykernel_9908/2107345999.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2["kind"] = final2[["q_amt_c", "q_amt_p"]].apply(better, axis=1)

In [25]:
final2.kind.value_counts()

1    1
Name: kind, dtype: int64

In [26]:
final2["inc_amt_py"] = final2["q_amt_c"] - final2["y_amt"]
final2["inc_pct_py"] = final2["inc_amt_py"] / abs(final2["y_amt"]) * 100

final2["inc_amt_pq"] = final2["q_amt_c"] - final2["q_amt_p"]
final2["inc_pct_pq"] = final2["inc_amt_pq"] / abs(final2["q_amt_p"]) * 100

C:\Users\User\AppData\Local\Temp/ipykernel_9908/1853080645.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2["inc_amt_py"] = final2["q_amt_c"] - final2["y_amt"]
C:\Users\User\AppData\Local\Temp/ipykernel_9908/1853080645.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2["inc_pct_py"] = final2["inc_amt_py"] / abs(final2["y_amt"]) * 100
C:\Users\User\AppData\Local\Temp/ipykernel_9908/1853080645.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2["inc_amt_pq"] = final2["q_amt_c"] - final2["q_amt_p"]
C:\Users\User\AppData\Local\Temp/ipykernel_9908/1853080645.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2["inc_pct_pq"] = final2["inc_amt_pq"] / abs(final2["q_amt_p"]) * 100

In [27]:
import numpy as np

final2["inc_pct_py"].replace("inf", np.nan, inplace=True)

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\generic.py:6619: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return self._update_inplace(result)

In [28]:
final2["mean_pct"] = final2[
    ["inc_pct_y", "inc_pct_q", "inc_pct_py", "inc_pct_pq"]
].mean(axis=1, skipna=True)

C:\Users\User\AppData\Local\Temp/ipykernel_9908/2665351611.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2["mean_pct"] = final2[

In [29]:
final2[["name", "mean_pct"]].sort_values(by=["mean_pct"], ascending=False)

  name   mean_pct
0   IP  18.242595

In [30]:
final2["std_pct"] = final2[["inc_pct_y", "inc_pct_q", "inc_pct_py", "inc_pct_pq"]].std(
    axis=1
)

C:\Users\User\AppData\Local\Temp/ipykernel_9908/4072014754.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final2["std_pct"] = final2[["inc_pct_y", "inc_pct_q", "inc_pct_py", "inc_pct_pq"]].std(

In [31]:
final2[["name", "std_pct"]].sort_values(by=["std_pct"], ascending=True)

  name    std_pct
0   IP  15.331267

In [32]:
sql = "SELECT name, id FROM tickers"
tickers = pd.read_sql(sql, conlt)
tickers.shape

(402, 2)

In [33]:
df_merge4 = pd.merge(final2, tickers, on="name", how="inner")
df_merge4.rename(columns={"id": "ticker_id"}, inplace=True)

final3 = df_merge4[
    [
        "name",
        "year",
        "quarter",
        "kind",
        "latest_amt_y",
        "previous_amt_y",
        "inc_amt_y",
        "inc_pct_y",
        "latest_amt_q",
        "previous_amt_q",
        "inc_amt_q",
        "inc_pct_q",
        "q_amt_c",
        "y_amt",
        "inc_amt_py",
        "inc_pct_py",
        "q_amt_p",
        "inc_amt_pq",
        "inc_pct_pq",
        "ticker_id",
        "mean_pct",
        "std_pct",
    ]
]
final3

,name,year,quarter,kind,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y,latest_amt_q,previous_amt_q,...,q_amt_c,y_amt,inc_amt_py,inc_pct_py,q_amt_p,inc_amt_pq,inc_pct_pq,ticker_id,mean_pct,std_pct
0,IP,2021,3,1,73677,61952,11725,18.925943,73677,66424,...,25710,18457,7253,39.296744,24762,948,3.828447,736,18.242595,15.331267

In [34]:
sql = """
SELECT *
FROM profits
WHERE year = %s AND quarter = %s
ORDER BY name"""
sql = sql % (year, quarter)
profits = pd.read_sql(sql, conlt)
profits

,id,name,year,quarter,kind,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y,latest_amt_q,...,q_amt_c,y_amt,inc_amt_py,inc_pct_py,q_amt_p,inc_amt_pq,inc_pct_pq,ticker_id,mean_pct,std_pct
0,2223,ADVANC,2021,3,0,27223149,27334917,-111768,-0.408884,27223149,...,6374062,6512671,-138609,-2.128297,7040817,-666755,-9.469853,6,-3.128403,4.300540
1,2153,AIT,2021,3,0,522365,380169,142196,37.403365,522365,...,117156,137197,-20041,-14.607462,136948,-19792,-14.452201,11,1.162217,24.694835
2,2188,AMATA,2021,3,0,1058096,957203,100893,10.540397,1058096,...,228699,268949,-40250,-14.965663,247074,-18375,-7.437043,21,-3.881727,10.701070
3,2235,AP,2021,3,0,4491151,4166157,324994,7.800810,4491151,...,1031202,1450434,-419232,-28.903900,1115001,-83799,-7.515599,25,-9.289088,15.061157
4,2158,ASIAN,2021,3,0,989973,624156,365817,58.609867,989973,...,271055,202235,68820,34.029718,293299,-22244,-7.584069,36,23.131647,29.247113
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
107,2187,TVO,2021,3,0,2434520,1585454,849066,53.553493,2434520,...,359733,355373,4360,1.226880,726268,-366535,-50.468284,585,1.122875,42.471631
108,2143,TYCN,2021,3,0,437354,-976576,1413930,144.784431,437354,...,133660,-18501,152161,822.447435,137794,-4134,-3.000131,737,254.396357,383.565686
109,2244,UOBKH,2021,3,0,358923,184162,174761,94.895255,358923,...,100785,47323,53462,112.972550,104599,-3814,-3.646306,739,55.430892,57.146564
110,2167,VNT,2021,3,1,5991930,2788821,3203109,114.855310,5991930,...,2082517,354324,1728193,487.743704,1789494,293023,16.374629,613,164.876499,219.286436
111,2173,WHART,2021,3,0,2308085,1901766,406319,21.365352,2308085,...,498779,481430,17349,3.603639,589243,-90464,-15.352579,622,2.593442,15.042562

In [35]:
df_merge = pd.merge(
    final3, profits, on=["name", "year", "quarter"], how="outer", indicator=True
)
df_merge

,name,year,quarter,kind_x,latest_amt_y_x,previous_amt_y_x,inc_amt_y_x,inc_pct_y_x,latest_amt_q_x,previous_amt_q_x,...,y_amt_y,inc_amt_py_y,inc_pct_py_y,q_amt_p_y,inc_amt_pq_y,inc_pct_pq_y,ticker_id_y,mean_pct_y,std_pct_y,_merge
0,IP,2021,3,1.0,73677.0,61952.0,11725.0,18.925943,73677.0,66424.0,...,18457,7253,39.296744,24762,948,3.828447,736,18.242595,15.331267,both
1,ADVANC,2021,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,6512671,-138609,-2.128297,7040817,-666755,-9.469853,6,-3.128403,4.300540,right_only
2,AIT,2021,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,137197,-20041,-14.607462,136948,-19792,-14.452201,11,1.162217,24.694835,right_only
3,AMATA,2021,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,268949,-40250,-14.965663,247074,-18375,-7.437043,21,-3.881727,10.701070,right_only
4,AP,2021,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,1450434,-419232,-28.903900,1115001,-83799,-7.515599,25,-9.289088,15.061157,right_only
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
107,TVO,2021,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,355373,4360,1.226880,726268,-366535,-50.468284,585,1.122875,42.471631,right_only
108,TYCN,2021,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,-18501,152161,822.447435,137794,-4134,-3.000131,737,254.396357,383.565686,right_only
109,UOBKH,2021,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,47323,53462,112.972550,104599,-3814,-3.646306,739,55.430892,57.146564,right_only
110,VNT,2021,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,354324,1728193,487.743704,1789494,293023,16.374629,613,164.876499,219.286436,right_only
111,WHART,2021,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,481430,17349,3.603639,589243,-90464,-15.352579,622,2.593442,15.042562,right_only

In [36]:
final4 = df_merge[df_merge["_merge"] == "left_only"]
final4

Empty DataFrame
Columns: [name, year, quarter, kind_x, latest_amt_y_x, previous_amt_y_x, inc_amt_y_x, inc_pct_y_x, latest_amt_q_x, previous_amt_q_x, inc_amt_q_x, inc_pct_q_x, q_amt_c_x, y_amt_x, inc_amt_py_x, inc_pct_py_x, q_amt_p_x, inc_amt_pq_x, inc_pct_pq_x, ticker_id_x, mean_pct_x, std_pct_x, id, kind_y, latest_amt_y_y, previous_amt_y_y, inc_amt_y_y, inc_pct_y_y, latest_amt_q_y, previous_amt_q_y, inc_amt_q_y, inc_pct_q_y, q_amt_c_y, y_amt_y, inc_amt_py_y, inc_pct_py_y, q_amt_p_y, inc_amt_pq_y, inc_pct_pq_y, ticker_id_y, mean_pct_y, std_pct_y, _merge]
Index: []

[0 rows x 43 columns]

In [37]:
final5 = final4[
    [
        "name",
        "year",
        "quarter",
        "kind_x",
        "latest_amt_y_x",
        "previous_amt_y_x",
        "inc_amt_y_x",
        "inc_pct_y_x",
        "latest_amt_q_x",
        "previous_amt_q_x",
        "inc_amt_q_x",
        "inc_pct_q_x",
        "q_amt_c_x",
        "y_amt_x",
        "inc_amt_py_x",
        "inc_pct_py_x",
        "q_amt_p_x",
        "inc_amt_pq_x",
        "inc_pct_pq_x",
        "ticker_id_x",
        "mean_pct_x",
        "std_pct_x",
    ]
]
final5.sort_values('name')

Empty DataFrame
Columns: [name, year, quarter, kind_x, latest_amt_y_x, previous_amt_y_x, inc_amt_y_x, inc_pct_y_x, latest_amt_q_x, previous_amt_q_x, inc_amt_q_x, inc_pct_q_x, q_amt_c_x, y_amt_x, inc_amt_py_x, inc_pct_py_x, q_amt_p_x, inc_amt_pq_x, inc_pct_pq_x, ticker_id_x, mean_pct_x, std_pct_x]
Index: []

[0 rows x 22 columns]

In [38]:
rcds = final5.values.tolist()
len(rcds)

0

In [39]:
for rcd in rcds:
    print(rcd)

In [40]:
sql = """
INSERT INTO profits (name, year, quarter, kind,
latest_amt_y, previous_amt_y, inc_amt_y, inc_pct_y,
latest_amt_q, previous_amt_q, inc_amt_q, inc_pct_q,
q_amt_c, y_amt, inc_amt_py, inc_pct_py,
q_amt_p, inc_amt_pq, inc_pct_pq,
ticker_id, mean_pct, std_pct)
VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)"""
print(sql)

INSERT INTO profits (name, year, quarter, kind,
latest_amt_y, previous_amt_y, inc_amt_y, inc_pct_y,
latest_amt_q, previous_amt_q, inc_amt_q, inc_pct_q,
q_amt_c, y_amt, inc_amt_py, inc_pct_py,
q_amt_p, inc_amt_pq, inc_pct_pq,
ticker_id, mean_pct, std_pct)
VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

In [41]:
for rcd in rcds:
    conlt.execute(sql, rcd)

### End of Create Data

In [42]:
sql = '''
SELECT name, market
FROM tickers'''
tickers = pd.read_sql(sql, conlt)
tickers.shape

(402, 2)

In [43]:
df_merge = pd.merge(final5, tickers, on='name', how='inner')
df_merge[['name','market']].sort_values('name')

Empty DataFrame
Columns: [name, market]
Index: []

### Insert Profits from PortLt to PortMy

In [44]:
names = """
IP
""".split()
names

['IP']

In [5]:
names = final5.name
names

NameError: name 'final5' is not defined

In [45]:
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

"'IP'"

In [46]:
#quarter = 3
sql = """
SELECT * 
FROM profits 
WHERE name IN (%s) AND year = %s AND quarter = %s"""
sql = sql % (in_p, year, quarter)
print(sql)

SELECT *
FROM profits
WHERE name IN ('IP') AND year = 2021 AND quarter = 3

In [47]:
profits_inp = pd.read_sql(sql, conlt)
profits_inp

,id,name,year,quarter,kind,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y,latest_amt_q,...,q_amt_c,y_amt,inc_amt_py,inc_pct_py,q_amt_p,inc_amt_pq,inc_pct_pq,ticker_id,mean_pct,std_pct
0,2214,IP,2021,3,1,73677,61952,11725,18.925943,73677,...,25710,18457,7253,39.296744,24762,948,3.828447,736,18.242595,15.331267

In [48]:
profits_inp.sort_values(by=["kind", "name"], ascending=[True, True])

,id,name,year,quarter,kind,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y,latest_amt_q,...,q_amt_c,y_amt,inc_amt_py,inc_pct_py,q_amt_p,inc_amt_pq,inc_pct_pq,ticker_id,mean_pct,std_pct
0,2214,IP,2021,3,1,73677,61952,11725,18.925943,73677,...,25710,18457,7253,39.296744,24762,948,3.828447,736,18.242595,15.331267

In [49]:
rcds = profits_inp.values.tolist()
len(rcds)

1

In [50]:
for rcd in rcds:
    print(rcd)

[2214, 'IP', 2021, 3, 1, 73677, 61952, 11725, 18.925942665289256, 73677, 66424, 7253, 10.919246055642539, 25710, 18457, 7253, 39.29674378284662, 24762, 948, 3.828446813666101, 736, 18.242594829361128, 15.331267100279224]

In [51]:
sql = """
INSERT INTO profits (id, name, year, quarter, kind,
latest_amt_y, previous_amt_y, inc_amt_y, inc_pct_y,
latest_amt_q, previous_amt_q, inc_amt_q, inc_pct_q,
q_amt_c, y_amt, inc_amt_py, inc_pct_py,
q_amt_p, inc_amt_pq, inc_pct_pq, ticker_id, mean_pct, std_pct)
VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)"""
print(sql)

INSERT INTO profits (id, name, year, quarter, kind,
latest_amt_y, previous_amt_y, inc_amt_y, inc_pct_y,
latest_amt_q, previous_amt_q, inc_amt_q, inc_pct_q,
q_amt_c, y_amt, inc_amt_py, inc_pct_py,
q_amt_p, inc_amt_pq, inc_pct_pq, ticker_id, mean_pct, std_pct)
VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

In [52]:
for rcd in rcds:
    conmy.execute(sql, rcd)

In [53]:
sql = '''
SELECT name, year, quarter 
FROM profits
ORDER BY name
'''
df_tmp = pd.read_sql(sql, conmy)
df_tmp.set_index('name', inplace=True)
df_tmp.index

Index(['ASK', 'BCH', 'BGRIM', 'BLA', 'CKP', 'DOHOME', 'EPG', 'GLOBAL', 'GULF',
       'IMH', 'IP', 'IVL', 'JMT', 'KBANK', 'KCE', 'LANNA', 'MCS', 'MEGA',
       'NER', 'PTL', 'PTT', 'RATCH', 'RCL', 'RJH', 'ROJNA', 'SAT', 'SINGER',
       'SIS', 'SMT', 'SPALI', 'STA', 'STARK', 'SVI', 'SYNEX', 'TKS', 'TOP',
       'TQM', 'TSE', 'TSTH', 'VNT'],
      dtype='object', name='name')

### After call 35-Export-to-PortPg

In [76]:
sql = """
SELECT * 
FROM profits 
WHERE name IN (%s) AND year = %s AND quarter = %s"""
sql = sql % (in_p, year, quarter)
print(sql)

SELECT *
FROM profits
WHERE name IN ('ROJNA') AND year = 2021 AND quarter = 3

In [77]:
profits_inp = pd.read_sql(sql, conpg)
profits_inp[['name','ticker_id']].sort_values(by=[ "name"], ascending=[True])

    name  ticker_id
0  ROJNA        409

In [58]:
sql = """
SELECT * 
FROM tickers
WHERE name IN (%s)
ORDER BY name"""
sql = sql % in_p
print(sql)

SELECT *
FROM tickers
WHERE name IN ('BCH', 'MEGA', 'RATCH')
ORDER BY name

In [59]:
tickers = pd.read_sql(sql, conpg)
tickers[['name','id']].sort_values(by=[ "name"], ascending=[True])

    name   id
0    BCH   55
1   MEGA  303
2  RATCH  399

### Delete process

In [78]:
names = """
BCH
MCS
MEGA
RATCH
""".split()
names

['BCH', 'MCS', 'MEGA', 'RATCH']

In [79]:
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

"'BCH', 'MCS', 'MEGA', 'RATCH'"

In [80]:
sql = """
SELECT * 
FROM profits 
WHERE name IN (%s)"""
sql = sql % (in_p)
df_tmp = pd.read_sql(sql, conmy)
df_tmp

,id,name,year,quarter,kind,latest_amt_y,previous_amt_y,inc_amt_y,inc_pct_y,latest_amt_q,...,q_amt_c,y_amt,inc_amt_py,inc_pct_py,q_amt_p,inc_amt_pq,inc_pct_pq,ticker_id,mean_pct,std_pct
0,2209,BCH,2021,3,1,4644042,1191940,3452102,289.620451,4644042,...,2896236,413364,2482872,600.650274,1145721,1750515,152.787197,51,289.485868,220.601529
1,2210,MEGA,2021,3,1,1877717,1347667,530050,39.330933,1877717,...,612614,342048,270566,79.101763,504288,108326,21.480979,295,39.187202,28.321477
2,2205,RATCH,2021,3,0,7778282,5062076,2716206,53.657946,7778282,...,1438113,1722225,-284112,-16.496799,2122841,-684728,-32.255265,394,0.345491,37.432883

In [51]:
sql = """
DELETE 
FROM profits 
WHERE name IN (%s)"""
sql = sql % (in_p)
#rp = conmy.execute(sql)
rp.rowcount

1